## sorting dataframes

In [3]:
import pandas as pd

C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\_distributor_init.py:32: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\.libs\libopenblas.NOIJJG62EMASZI6NYURL6JBKM4EVBGM7.gfortran-win_amd64.dll
C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\.libs\libopenblas.PYQHXLVVQ7VESDPUVUADXEVJOBGHJPAY.gfortran-win_amd64.dll
  stacklevel=1)

In [4]:
titanic = pd.read_csv('titanic.csv')

In [5]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [6]:
titanic.age.sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [7]:
titanic.sort_values(by='age')

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
803         1       3    male  0.42      0      1   8.5167        C  NaN
755         1       2    male  0.67      1      1  14.5000        S  NaN
644         1       3  female  0.75      2      1  19.2583        C  NaN
469         1       3  female  0.75      2      1  19.2583        C  NaN
78          1       2    male  0.83      0      2  29.0000        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
859         0       3    male   NaN      0      0   7.2292        C  NaN
863         0       3  female   NaN      8      2  69.5500        S  NaN
868         0       3    male   NaN      0      0   9.5000        S  NaN
878         0       3    male   NaN      0      0   7.8958        S  NaN
888         0       3  female   NaN      1      2  23.4500        S  NaN

[891 rows x 9 columns]

In [8]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [10]:
titanic.sort_values(by='age', ascending=False, inplace=True)

In [11]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
630         1       1    male  80.0      0      0  30.0000        S    A
851         0       3    male  74.0      0      0   7.7750        S  NaN
493         0       1    male  71.0      0      0  49.5042        C  NaN
96          0       1    male  71.0      0      0  34.6542        C    A
116         0       3    male  70.5      0      0   7.7500        Q  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
859         0       3    male   NaN      0      0   7.2292        C  NaN
863         0       3  female   NaN      8      2  69.5500        S  NaN
868         0       3    male   NaN      0      0   9.5000        S  NaN
878         0       3    male   NaN      0      0   7.8958        S  NaN
888         0       3  female   NaN      1      2  23.4500        S  NaN

[891 rows x 9 columns]

In [21]:
titanic.sort_values(by=['pclass', 'sex', 'age'], ascending=[True, True, False], inplace=True)

In [22]:
pd.options.display.max_rows=100

In [23]:
titanic

     survived  pclass     sex   age  sibsp  parch      fare embarked deck
275         1       1  female  63.0      1      0   77.9583        S    D
829         1       1  female  62.0      0      0   80.0000      NaN    B
366         1       1  female  60.0      1      0   75.2500        C    D
268         1       1  female  58.0      0      1  153.4625        S    C
11          1       1  female  58.0      0      0   26.5500        S    C
..        ...     ...     ...   ...    ...    ...       ...      ...  ...
837         0       3    male   NaN      0      0    8.0500        S  NaN
846         0       3    male   NaN      8      2   69.5500        S  NaN
859         0       3    male   NaN      0      0    7.2292        C  NaN
868         0       3    male   NaN      0      0    9.5000        S  NaN
878         0       3    male   NaN      0      0    7.8958        S  NaN

[891 rows x 9 columns]

In [24]:
titanic.sort_index(ascending=True, inplace=True)

In [26]:
titanic.sort_values(by='age').reset_index(drop=True)

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           1       3    male  0.42      0      1   8.5167        C  NaN
1           1       2    male  0.67      1      1  14.5000        S  NaN
2           1       3  female  0.75      2      1  19.2583        C  NaN
3           1       3  female  0.75      2      1  19.2583        C  NaN
4           1       2    male  0.83      0      2  29.0000        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       3    male   NaN      0      0   7.2292        C  NaN
887         0       3  female   NaN      8      2  69.5500        S  NaN
888         0       3    male   NaN      0      0   9.5000        S  NaN
889         0       3    male   NaN      0      0   7.8958        S  NaN
890         0       3  female   NaN      1      2  23.4500        S  NaN

[891 rows x 9 columns]

In [27]:
titanic.sort_values(by='age', ignore_index=True)

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           1       3    male  0.42      0      1   8.5167        C  NaN
1           1       2    male  0.67      1      1  14.5000        S  NaN
2           1       3  female  0.75      2      1  19.2583        C  NaN
3           1       3  female  0.75      2      1  19.2583        C  NaN
4           1       2    male  0.83      0      2  29.0000        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       3    male   NaN      0      0   7.2292        C  NaN
887         0       3  female   NaN      8      2  69.5500        S  NaN
888         0       3    male   NaN      0      0   9.5000        S  NaN
889         0       3    male   NaN      0      0   7.8958        S  NaN
890         0       3  female   NaN      1      2  23.4500        S  NaN

[891 rows x 9 columns]

## ranking dataframes with rank()

In [28]:
sales = pd.Series([15, 32, 45, 21, 55, 15, 0], index=['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'])

In [29]:
sales

Mon    15
Tue    32
Wed    45
Thu    21
Fri    55
Sat    15
Sun     0
dtype: int64

In [30]:
sales.sort_values(ascending=False)

Fri    55
Wed    45
Tue    32
Thu    21
Sat    15
Mon    15
Sun     0
dtype: int64

In [81]:
sales.rank().sort_values()

Sun    1.0
Mon    2.5
Sat    2.5
Thu    4.0
Tue    5.0
Wed    6.0
Fri    7.0
dtype: float64

In [35]:
sales.rank(ascending=False, method='min').sort_values(ascending=True)

Fri    1.0
Wed    2.0
Tue    3.0
Thu    4.0
Mon    5.0
Sat    5.0
Sun    7.0
dtype: float64

In [36]:
sales.rank(ascending=False, method='min', pct=True).sort_values()

Fri    0.142857
Wed    0.285714
Tue    0.428571
Thu    0.571429
Mon    0.714286
Sat    0.714286
Sun    1.000000
dtype: float64

In [37]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [38]:
titanic.fare.rank(ascending=False)

0      815.0
1      103.0
2      659.5
3      144.0
4      628.0
       ...
886    484.5
887    237.5
888    345.5
889    237.5
890    768.5
Name: fare, Length: 891, dtype: float64

In [39]:
titanic['fare_rank'] = titanic.fare.rank(ascending=False, method='min')

In [40]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,fare_rank
0,0,3,male,22.0,1,0,7.2500,S,NaN,809.0
1,1,1,female,38.0,1,0,71.2833,C,C,103.0
2,1,3,female,26.0,0,0,7.9250,S,NaN,651.0
3,1,1,female,35.0,1,0,53.1000,S,C,142.0
4,0,3,male,35.0,0,0,8.0500,S,NaN,607.0
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,NaN,464.0
887,1,1,female,19.0,0,0,30.0000,S,B,235.0
888,0,3,female,NaN,1,2,23.4500,S,NaN,345.0
889,1,1,male,26.0,0,0,30.0000,C,C,235.0
890,0,3,male,32.0,0,0,7.7500,Q,NaN,752.0

In [41]:
titanic.sort_values('fare', ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,fare_rank
258,1,1,female,35.0,0,0,512.3292,C,NaN,1.0
737,1,1,male,35.0,0,0,512.3292,C,B,1.0
679,1,1,male,36.0,0,1,512.3292,C,B,1.0
88,1,1,female,23.0,3,2,263.0000,S,C,4.0
27,0,1,male,19.0,3,2,263.0000,S,C,4.0
...,...,...,...,...,...,...,...,...,...,...
633,0,1,male,NaN,0,0,0.0000,S,NaN,877.0
413,0,2,male,NaN,0,0,0.0000,S,NaN,877.0
822,0,1,male,38.0,0,0,0.0000,S,NaN,877.0
732,0,2,male,NaN,0,0,0.0000,S,NaN,877.0
674,0,2,male,NaN,0,0,0.0000,S,NaN,877.0

In [42]:
titanic.drop(columns='fare_rank', inplace=True)

## nunique(), nlargest(), and nsmallest() with dataframes

In [43]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [45]:
titanic.age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [49]:
titanic.nunique(axis=0, dropna=False)

survived      2
pclass        3
sex           2
age          89
sibsp         7
parch         7
fare        248
embarked      4
deck          8
dtype: int64

In [51]:
titanic.nlargest(n=5, columns='fare')

     survived  pclass     sex   age  sibsp  parch      fare embarked deck
258         1       1  female  35.0      0      0  512.3292        C  NaN
679         1       1    male  36.0      0      1  512.3292        C    B
737         1       1    male  35.0      0      0  512.3292        C    B
27          0       1    male  19.0      3      2  263.0000        S    C
88          1       1  female  23.0      3      2  263.0000        S    C

In [85]:
titanic.sort_values('fare', ascending=False).head(5)

     survived  pclass     sex   age  sibsp  parch      fare embarked deck
258         1       1  female  35.0      0      0  512.3292        C  NaN
737         1       1    male  35.0      0      0  512.3292        C    B
679         1       1    male  36.0      0      1  512.3292        C    B
88          1       1  female  23.0      3      2  263.0000        S    C
27          0       1    male  19.0      3      2  263.0000        S    C

In [88]:
titanic.sort_values(['fare', 'age'], ascending = [False, False]).head(20)

     survived  pclass     sex   age  sibsp  parch      fare embarked deck
679         1       1    male  36.0      0      1  512.3292        C    B
258         1       1  female  35.0      0      0  512.3292        C  NaN
737         1       1    male  35.0      0      0  512.3292        C    B
438         0       1    male  64.0      1      4  263.0000        S    C
341         1       1  female  24.0      3      2  263.0000        S    C
88          1       1  female  23.0      3      2  263.0000        S    C
27          0       1    male  19.0      3      2  263.0000        S    C
742         1       1  female  21.0      2      2  262.3750        C    B
311         1       1  female  18.0      2      2  262.3750        C    B
299         1       1  female  50.0      0      1  247.5208        C    B
118         0       1    male  24.0      0      1  247.5208        C    B
380         1       1  female  42.0      0      0  227.5250        C  NaN
716         1       1  female  38.0      0      0  227.5250        C    C
700         1       1  female  18.0      1      0  227.5250        C    C
557         0       1    male   NaN      0      0  227.5250        C  NaN
527         0       1    male   NaN      0      0  221.7792        S    C
377         0       1    male  27.0      0      2  211.5000        C    C
779         1       1  female  43.0      0      1  211.3375        S    B
730         1       1  female  29.0      0      0  211.3375        S    B
689         1       1  female  15.0      0      1  211.3375        S    B

In [55]:
titanic.nsmallest(n=1, columns='age')

     survived  pclass   sex   age  sibsp  parch    fare embarked deck
803         1       3  male  0.42      0      1  8.5167        C  NaN

In [56]:
titanic.loc[titanic.age.idxmin()]

survived         1
pclass           3
sex           male
age           0.42
sibsp            0
parch            1
fare        8.5167
embarked         C
deck           NaN
Name: 803, dtype: object

In [57]:
titanic.age.idxmin()

803

## summary statistics and accumulations

In [58]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [59]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [65]:
titanic.count(axis=0)

survived    891
pclass      891
sex         891
age         714
sibsp       891
parch       891
fare        891
embarked    889
deck        203
dtype: int64

In [61]:
titanic.count(axis=1)

0      8
1      9
2      8
3      9
4      8
      ..
886    8
887    9
888    7
889    9
890    8
Length: 891, dtype: int64

In [62]:
titanic.mean(axis=0)

survived     0.383838
pclass       2.308642
age         29.699118
sibsp        0.523008
parch        0.381594
fare        32.204208
dtype: float64

In [67]:
titanic.mean(axis=1)

0       5.541667
1      18.713883
2       6.320833
3      15.183333
4       7.675000
         ...
886     7.000000
887     8.500000
888     5.890000
889     9.666667
890     7.125000
Length: 891, dtype: float64

In [66]:
titanic.sum(axis=0)

survived                                                  342
pclass                                                   2057
sex         malefemalefemalefemalemalemalemalemalefemalefe...
age                                                   21205.2
sibsp                                                     466
parch                                                     340
fare                                                  28693.9
dtype: object

In [68]:
titanic.sum(axis=1)

0       33.2500
1      112.2833
2       37.9250
3       91.1000
4       46.0500
         ...
886     42.0000
887     51.0000
888     29.4500
889     58.0000
890     42.7500
Length: 891, dtype: float64

In [69]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [70]:
titanic.fare.cumsum(axis=0)

0          7.2500
1         78.5333
2         86.4583
3        139.5583
4        147.6083
          ...
886    28602.7493
887    28632.7493
888    28656.1993
889    28686.1993
890    28693.9493
Name: fare, Length: 891, dtype: float64

In [71]:
titanic.corr()

          survived    pclass       age     sibsp     parch      fare
survived  1.000000 -0.338481 -0.077221 -0.035322  0.081629  0.257307
pclass   -0.338481  1.000000 -0.369226  0.083081  0.018443 -0.549500
age      -0.077221 -0.369226  1.000000 -0.308247 -0.189119  0.096067
sibsp    -0.035322  0.083081 -0.308247  1.000000  0.414838  0.159651
parch     0.081629  0.018443 -0.189119  0.414838  1.000000  0.216225
fare      0.257307 -0.549500  0.096067  0.159651  0.216225  1.000000

In [72]:
titanic.survived.corr(titanic.pclass)

-0.3384810359610158

## the agg() method

In [73]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [74]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [75]:
titanic.mean()

survived     0.383838
pclass       2.308642
age         29.699118
sibsp        0.523008
parch        0.381594
fare        32.204208
dtype: float64

In [76]:
titanic.agg('mean')

survived     0.383838
pclass       2.308642
age         29.699118
sibsp        0.523008
parch        0.381594
fare        32.204208
dtype: float64

In [77]:
titanic.agg(['mean', 'std'])

      survived    pclass        age     sibsp     parch       fare
mean  0.383838  2.308642  29.699118  0.523008  0.381594  32.204208
std   0.486592  0.836071  14.526497  1.102743  0.806057  49.693429

In [78]:
titanic.agg(['mean', 'std', 'min', 'max', 'median'])

        survived    pclass     sex        age     sibsp     parch        fare
mean    0.383838  2.308642     NaN  29.699118  0.523008  0.381594   32.204208
std     0.486592  0.836071     NaN  14.526497  1.102743  0.806057   49.693429
min     0.000000  1.000000  female   0.420000  0.000000  0.000000    0.000000
max     1.000000  3.000000    male  80.000000  8.000000  6.000000  512.329200
median  0.000000  3.000000     NaN  28.000000  0.000000  0.000000   14.454200

In [79]:
titanic.agg({'survived': 'mean', 'age':['min', 'max']})

      survived    age
max        NaN  80.00
mean  0.383838    NaN
min        NaN   0.42

In [82]:
titanic.loc[:, ['survived','pclass','fare']]

     survived  pclass     fare
0           0       3   7.2500
1           1       1  71.2833
2           1       3   7.9250
3           1       1  53.1000
4           0       3   8.0500
..        ...     ...      ...
886         0       2  13.0000
887         1       1  30.0000
888         0       3  23.4500
889         1       1  30.0000
890         0       3   7.7500

[891 rows x 3 columns]

In [91]:
titanic.nlargest(10, ['fare', 'age'])

     survived  pclass     sex   age  sibsp  parch      fare embarked deck
679         1       1    male  36.0      0      1  512.3292        C    B
258         1       1  female  35.0      0      0  512.3292        C  NaN
737         1       1    male  35.0      0      0  512.3292        C    B
438         0       1    male  64.0      1      4  263.0000        S    C
341         1       1  female  24.0      3      2  263.0000        S    C
88          1       1  female  23.0      3      2  263.0000        S    C
27          0       1    male  19.0      3      2  263.0000        S    C
742         1       1  female  21.0      2      2  262.3750        C    B
311         1       1  female  18.0      2      2  262.3750        C    B
299         1       1  female  50.0      0      1  247.5208        C    B

In [96]:
children = titanic.age < 16
parents = titanic.parch == 0

titanic.loc[children & parents, ['age', 'sex', 'survived']].sort_values('age')

      age     sex  survived
777   5.0  female         1
731  11.0    male         0
125  12.0    male         1
780  13.0  female         1
9    14.0  female         1
14   14.0  female         0
39   14.0  female         1
111  14.5  female         0
22   15.0  female         1
830  15.0  female         1
875  15.0  female         1

In [97]:
females = titanic.sex == 'female'
lower_class = titanic.pclass != 1
col_list = ['pclass', 'age', 'fare']
slice = titanic.loc[females & lower_class, col_list]
slice.nlargest(20, ['age', 'fare'])

     pclass   age     fare
483       3  63.0   9.5875
772       2  57.0  10.5000
15        2  55.0  16.0000
774       2  54.0  23.0000
259       2  50.0  26.0000
458       2  50.0  10.5000
526       2  50.0  10.5000
754       2  48.0  65.0000
736       3  48.0  34.3750
132       3  47.0  14.5000
167       3  45.0  27.9000
440       2  45.0  26.2500
362       3  45.0  14.4542
706       2  45.0  13.5000
276       3  45.0   7.7500
854       2  44.0  26.0000
678       3  43.0  46.9000
432       2  42.0  26.0000
865       2  42.0  13.0000
638       3  41.0  39.6875

In [99]:
children = titanic.age < 18
low_class = titanic.pclass == 3
survival = titanic.survived == 1
slice = titanic.loc[children & low_class & survival, :]
slice.sort_values(['age', 'fare'], ascending=[True, False])

     survived  pclass     sex    age  sibsp  parch     fare embarked deck
803         1       3    male   0.42      0      1   8.5167        C  NaN
469         1       3  female   0.75      2      1  19.2583        C  NaN
644         1       3  female   0.75      2      1  19.2583        C  NaN
788         1       3    male   1.00      1      2  20.5750        S  NaN
381         1       3  female   1.00      0      2  15.7417        C  NaN
172         1       3  female   1.00      1      1  11.1333        S  NaN
479         1       3  female   2.00      0      1  12.2875        S  NaN
261         1       3    male   3.00      4      2  31.3875        S  NaN
348         1       3    male   3.00      1      1  15.9000        S  NaN
184         1       3  female   4.00      0      2  22.0250        S  NaN
10          1       3  female   4.00      1      1  16.7000        S    G
691         1       3  female   4.00      0      1  13.4167        C  NaN
869         1       3    male   4.00      1      1  11.1333        S  NaN
233         1       3  female   5.00      4      2  31.3875        S  NaN
448         1       3  female   5.00      2      1  19.2583        C  NaN
777         1       3  female   5.00      0      0  12.4750        S  NaN
751         1       3    male   6.00      0      1  12.4750        S    E
165         1       3    male   9.00      0      2  20.5250        S  NaN
489         1       3    male   9.00      1      1  15.9000        S  NaN
125         1       3    male  12.00      1      0  11.2417        C  NaN
780         1       3  female  13.00      0      0   7.2292        C  NaN
39          1       3  female  14.00      1      0  11.2417        C  NaN
830         1       3  female  15.00      1      0  14.4542        C  NaN
22          1       3  female  15.00      0      0   8.0292        Q  NaN
875         1       3  female  15.00      0      0   7.2250        C  NaN
220         1       3    male  16.00      0      0   8.0500        S  NaN
208         1       3  female  16.00      0      0   7.7500        Q  NaN
156         1       3  female  16.00      0      0   7.7333        Q  NaN
68          1       3  female  17.00      4      2   7.9250        S  NaN

In [100]:
children = titanic.age < 18
low_class = titanic.pclass == 3
survival = titanic.survived == 1
df_slice = titanic.loc[children & low_class & survival, :]
df_slice.sort_values(['age', 'fare'], ascending=[True, False])

     survived  pclass     sex    age  sibsp  parch     fare embarked deck
803         1       3    male   0.42      0      1   8.5167        C  NaN
469         1       3  female   0.75      2      1  19.2583        C  NaN
644         1       3  female   0.75      2      1  19.2583        C  NaN
788         1       3    male   1.00      1      2  20.5750        S  NaN
381         1       3  female   1.00      0      2  15.7417        C  NaN
172         1       3  female   1.00      1      1  11.1333        S  NaN
479         1       3  female   2.00      0      1  12.2875        S  NaN
261         1       3    male   3.00      4      2  31.3875        S  NaN
348         1       3    male   3.00      1      1  15.9000        S  NaN
184         1       3  female   4.00      0      2  22.0250        S  NaN
10          1       3  female   4.00      1      1  16.7000        S    G
691         1       3  female   4.00      0      1  13.4167        C  NaN
869         1       3    male   4.00      1      1  11.1333        S  NaN
233         1       3  female   5.00      4      2  31.3875        S  NaN
448         1       3  female   5.00      2      1  19.2583        C  NaN
777         1       3  female   5.00      0      0  12.4750        S  NaN
751         1       3    male   6.00      0      1  12.4750        S    E
165         1       3    male   9.00      0      2  20.5250        S  NaN
489         1       3    male   9.00      1      1  15.9000        S  NaN
125         1       3    male  12.00      1      0  11.2417        C  NaN
780         1       3  female  13.00      0      0   7.2292        C  NaN
39          1       3  female  14.00      1      0  11.2417        C  NaN
830         1       3  female  15.00      1      0  14.4542        C  NaN
22          1       3  female  15.00      0      0   8.0292        Q  NaN
875         1       3  female  15.00      0      0   7.2250        C  NaN
220         1       3    male  16.00      0      0   8.0500        S  NaN
208         1       3  female  16.00      0      0   7.7500        Q  NaN
156         1       3  female  16.00      0      0   7.7333        Q  NaN
68          1       3  female  17.00      4      2   7.9250        S  NaN

In [101]:
titanic.age.agg('mean')

29.69911764705882

## apply(), map(), and applymap()

In [2]:
import pandas as pd

C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\_distributor_init.py:32: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\.libs\libopenblas.NOIJJG62EMASZI6NYURL6JBKM4EVBGM7.gfortran-win_amd64.dll
C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\.libs\libopenblas.PYQHXLVVQ7VESDPUVUADXEVJOBGHJPAY.gfortran-win_amd64.dll
  stacklevel=1)

In [4]:
sales = pd.read_csv('sales.csv', index_col=0)

In [5]:
sales

        Mon  Tue  Wed   Thu  Fri
Steven   34   27   15   NaN   33
Mike     45    9   74  87.0   12
Andi     17   33   54   8.0   29
Paul     87   67   27  45.0    7

In [7]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Steven to Paul
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Mon     4 non-null      int64
 1   Tue     4 non-null      int64
 2   Wed     4 non-null      int64
 3   Thu     3 non-null      float64
 4   Fri     4 non-null      int64
dtypes: float64(1), int64(4)
memory usage: 192.0+ bytes

In [8]:
sales.min(axis=0)

Mon    17.0
Tue     9.0
Wed    15.0
Thu     8.0
Fri     7.0
dtype: float64